Revit 2027 API
FabricationItemFile.IsValid Method
 Checks to see if the item file is valid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValid()
Public Function IsValid As Boolean
public:
bool IsValid()
member IsValid : unit -> bool
Return Value
Boolean
 Returns true if the item file is valid, false otherwise.
See Also
Reference
FabricationItemFile Class
Autodesk.Revit.DB Namespace